Catalogs/ГруппыВнешнихПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ГруппыВнешнихПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектовАвторизации</Name>
					<Comment>В качестве типа используется пустая ссылка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеОбъектыАвторизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВнешнийПользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СоставыГруппПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СоставыГруппПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГруппыВнешнихПользователей/Ext/ObjectModule.bsl
Перем СтарыйРодитель; // Значение родителя группы до изменения для использования
//                       в обработчике события ПриЗаписи.

Перем ИзменилсяСоставРолейГруппыВнешнихПользователей; // Флажок изменения состава ролей для использования
//                                                       в обработчике события ПриЗаписи.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Блокирует недопустимые действия с предопределенной группой "Все внешние пользователи".
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка = Справочники.ГруппыВнешнихПользователей.ВсеВнешниеПользователи Тогда
		
		ТипОбъектовАвторизации = Неопределено;
		ВсеОбъектыАвторизации  = Ложь;
		
		Если НЕ Родитель.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Предопределенная группа ""Все внешние пользователи"" может быть только в корне.';uk='Визначена група ""Усі зовнішні користувачі"" може бути тільки в корені.'"),
				, , , Отказ);
			Возврат;
		КонецЕсли;
		Если Состав.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Добавление внешних пользователей в группу ""Все внешние пользователи"" не поддерживается.';uk='Додавання зовнішніх користувачів у групу ""Усі зовнішні користувачі"" не підтримується.'"),
				, , , Отказ);
			Возврат;
		КонецЕсли;
	Иначе
		Если Родитель = Справочники.ГруппыВнешнихПользователей.ВсеВнешниеПользователи Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Предопределенная группа ""Все внешние пользователи"" не может быть родителем.';uk='Визначена група ""Усі зовнішні користувачі"" не може бути батьком.'"),
				, , , Отказ);
			Возврат;
		КонецЕсли;
		СтарыйРодитель = ?(Ссылка.Пустая(), Неопределено, ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, "Родитель"));
		
		Если ТипОбъектовАвторизации = Неопределено Тогда
			ВсеОбъектыАвторизации = Ложь;
		ИначеЕсли ВсеОбъектыАвторизации И ЗначениеЗаполнено(Родитель) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Родитель недопустим у группы для всех объектов информационной базы заданного типа.';uk=""Батько неприпустимий у групи для всіх об'єктів інформаційної бази заданого типу."""),
				, , , Отказ);
			Возврат;
		КонецЕсли;
		
		// Проверка уникальности группы всех объектов авторизации заданного типа
		Если ВсеОбъектыАвторизации Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕ(ГруппыВнешнихПользователей.Ссылка) КАК СсылкаПредставление
			|ИЗ
			|	Справочник.ГруппыВнешнихПользователей КАК ГруппыВнешнихПользователей
			|ГДЕ
			|	ГруппыВнешнихПользователей.Ссылка <> &Ссылка
			|	И ГруппыВнешнихПользователей.ТипОбъектовАвторизации = &ТипОбъектовАвторизации
			|	И ГруппыВнешнихПользователей.ВсеОбъектыАвторизации");
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ТипОбъектовАвторизации", ТипОбъектовАвторизации);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Уже есть группа ""%1"" для всех объектов информационной базы типа ""%2"".';uk=' Уже є група ""%1"" для всіх об''єктів інформаційної бази типу ""%2"".'"),
						Выборка.СсылкаПредставление,
						ТипОбъектовАвторизации.Метаданные().Синоним),
					, , , Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка совпадения типа объектов авторизации с родителем (допустимо, если тип у родителя не задан)
		Если ЗначениеЗаполнено(Родитель) Тогда
			ТипОбъектовАвторизацииРодителя = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Родитель, "ТипОбъектовАвторизации");
			Если ТипОбъектовАвторизацииРодителя <> Неопределено И
			     ТипОбъектовАвторизацииРодителя <> ТипОбъектовАвторизации Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Тип объектов информационной базы должен быть ""%1"", как у родителя ""%2"".';uk='Тип об''єктів інформаційної бази повинен бути ""%1"", як у батька ""%2"".'"),
						ТипОбъектовАвторизацииРодителя.Метаданные().Синоним, Родитель),
					, , , Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка, что при изменении типа объектов авторизации нет подчиненных элементов другого типа (очистка типа допустима)
		Если ТипОбъектовАвторизации <> Неопределено И ЗначениеЗаполнено(Ссылка) Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕ(ГруппыВнешнихПользователей.Ссылка) КАК СсылкаПредставление,
			|	ГруппыВнешнихПользователей.ТипОбъектовАвторизации
			|ИЗ
			|	Справочник.ГруппыВнешнихПользователей КАК ГруппыВнешнихПользователей
			|ГДЕ
			|	ГруппыВнешнихПользователей.Родитель = &Ссылка
			|	И ГруппыВнешнихПользователей.ТипОбъектовАвторизации <> &ТипОбъектовАвторизации");
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ТипОбъектовАвторизации", ТипОбъектовАвторизации);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.ТипОбъектовАвторизации = Неопределено Тогда
					ПредставлениеДругогоТипаОбъектаАвторизации = НСтр("ru='<Любой тип>';uk='<Будь-який тип>'");
				Иначе
					ПредставлениеДругогоТипаОбъектаАвторизации = Выборка.ТипОбъектовАвторизации.Метаданные().Синоним;
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Есть дочерняя группа ""%1"" с другим типом объектов информационной базы ""%2"".';uk=' Є дочірня група ""%1"" з іншим типом об''єктів інформаційної бази ""%2"".'"),
						Выборка.СсылкаПредставление,
						ПредставлениеДругогоТипаОбъектаАвторизации),
					, , , Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Определение изменения состава ролей.
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	НовыеРоли.Роль
			|ПОМЕСТИТЬ НовыеРоли
			|ИЗ
			|	&НовыеРоли КАК НовыеРоли
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК Значение
			|ИЗ
			|	НовыеРоли КАК НовыеРоли
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыВнешнихПользователей.Роли КАК СтарыеРоли
			|		ПО (СтарыеРоли.Ссылка = &ГруппаВнешнихПользователей)
			|			И (СтарыеРоли.Роль = НовыеРоли.Роль)
			|ГДЕ
			|	СтарыеРоли.Роль ЕСТЬ NULL 
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА
			|ИЗ
			|	(ВЫБРАТЬ
			|		ИСТИНА КАК ЗначениеИстина) КАК ЗначениеИстина
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыВнешнихПользователей.Роли КАК СтарыеРоли
			|		ПО (СтарыеРоли.Ссылка = &ГруппаВнешнихПользователей)
			|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеРоли КАК НовыеРоли
			|		ПО (СтарыеРоли.Роль = НовыеРоли.Роль)
			|ГДЕ
			|	НовыеРоли.Роль ЕСТЬ NULL ");
			Запрос.УстановитьПараметр("ГруппаВнешнихПользователей", Ссылка);
			Запрос.УстановитьПараметр("НовыеРоли", Роли.Выгрузить());
			ИзменилсяСоставРолейГруппыВнешнихПользователей = НЕ Запрос.Выполнить().Пустой();
		Иначе
			ИзменилсяСоставРолейГруппыВнешнихПользователей = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененныеВнешниеПользователи = Неопределено;
	ВнешниеПользователи.ОбновитьСоставГруппВнешнихПользователей(Ссылка, ИзмененныеВнешниеПользователи);
	
	Если Ссылка = Справочники.ГруппыВнешнихПользователей.ВсеВнешниеПользователи Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СоставыГруппПользователей.Пользователь
		|ИЗ
		|	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|ГДЕ
		|	СоставыГруппПользователей.ГруппаПользователей = ЗНАЧЕНИЕ(Справочник.ГруппыВнешнихПользователей.ВсеВнешниеПользователи)");
		ИзмененныеВнешниеПользователи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
		
	ИначеЕсли ИзменилсяСоставРолейГруппыВнешнихПользователей Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СоставыГруппПользователей.Пользователь
		|ИЗ
		|	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|ГДЕ
		|	СоставыГруппПользователей.Пользователь В(&ИзмененныеВнешниеПользователи)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ГруппыВнешнихПользователейСостав.ВнешнийПользователь
		|ИЗ
		|	Справочник.ГруппыВнешнихПользователей.Состав КАК ГруппыВнешнихПользователейСостав
		|ГДЕ
		|	ГруппыВнешнихПользователейСостав.Ссылка = &ГруппаВнешнихПользователей
		|	И (НЕ ГруппыВнешнихПользователейСостав.ВнешнийПользователь.УстановитьРолиНепосредственно)");
		Запрос.УстановитьПараметр("ГруппаВнешнихПользователей",    Ссылка);
		Запрос.УстановитьПараметр("ИзмененныеВнешниеПользователи", ИзмененныеВнешниеПользователи);
		ИзмененныеВнешниеПользователи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	КонецЕсли;
		
	ВнешниеПользователи.ОбновитьРолиВнешнихПользователей(ИзмененныеВнешниеПользователи);
	
	Если ЗначениеЗаполнено(СтарыйРодитель) И СтарыйРодитель <> Родитель Тогда
		
		ВнешниеПользователи.ОбновитьСоставГруппВнешнихПользователей(СтарыйРодитель, ИзмененныеВнешниеПользователи);
		ВнешниеПользователи.ОбновитьРолиВнешнихПользователей(ИзмененныеВнешниеПользователи);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверенныеРеквизитыОбъекта = Новый Массив;
	Ошибки = Неопределено;
	
	// Проверка использования родителя.
	Если Родитель = Справочники.ГруппыВнешнихПользователей.ВсеВнешниеПользователи Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект.Родитель",
			НСтр("ru='Предопределенная группа ""Все внешние пользователи"" не может быть родителем.';uk='Визначена група ""Усі зовнішні користувачі"" не може бути батьком.'"));
	КонецЕсли;
	
	// Проверка незаполненных и повторяющихся внешних пользователей.
	ПроверенныеРеквизитыОбъекта.Добавить("Состав.ВнешнийПользователь");
	
	Для каждого ТекущаяСтрока Из Состав Цикл
		НомерСтроки = Состав.Индекс(ТекущаяСтрока);
		
		// Проверка заполнения значения.
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВнешнийПользователь) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Состав[%1].ВнешнийПользователь",
				НСтр("ru='Внешний пользователь не выбран.';uk='Зовнішній користувач не обраний.'"),
				"Объект.Состав",
				НомерСтроки,
				НСтр("ru='Внешний пользователь в строке %1 не выбран.';uk='Зовнішній користувач у рядку %1 не обраний.'"));
			Продолжить;
		КонецЕсли;
		
		// Проверка наличия повторяющихся значений.
		НайденныеЗначения = Состав.НайтиСтроки(Новый Структура("ВнешнийПользователь", ТекущаяСтрока.ВнешнийПользователь));
		Если НайденныеЗначения.Количество() > 1 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Состав[%1].ВнешнийПользователь",
				НСтр("ru='Внешний пользователь повторяется.';uk='Зовнішній користувач повторюється.'"),
				"Объект.Состав",
				НомерСтроки,
				НСтр("ru='Внешний пользователь в строке %1 повторяется.';uk='Зовнішній користувач у рядку %1 повторюється.'"));
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПроверенныеРеквизитыОбъекта);
	
КонецПроцедуры
